In [4]:
import pandas as pd
import numpy as np

if __name__ == "__main__":

    data = {
        "unit price" : [1000,280,900],
        "number" : [25,120,30],
    }
    
    df = pd.DataFrame(data, index=['store1','store2','store3'], columns=['unit price','number'])
    display(df)

    df['total price'] = df['unit price'] * df['number']
    display(df)

    df = df.sort_values(by="total price",ascending=False)
    display(df.head(2))

        unit price  number
store1        1000      25
store2         280     120
store3         900      30

        unit price  number  total price
store1        1000      25        25000
store2         280     120        33600
store3         900      30        27000

        unit price  number  total price
store2         280     120        33600
store3         900      30        27000